dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_AUGUST_CYW43012_M0_PSA/mcuboot/bootutil/src/loader.c
    return 0;
}
#else
static int
split_image_check(struct image_header *app_hdr,
                  const struct flash_area *app_fap,
                  struct image_header *loader_hdr,
                  const struct flash_area *loader_fap)
{
    static void *tmpbuf;
    uint8_t loader_hash[CY_BOOTLDR_SHA256_LEN];

    if (!tmpbuf) {
        tmpbuf = malloc(BOOT_TMPBUF_SZ);
        if (!tmpbuf) {
            return BOOT_ENOMEM;
        }
    }

    if (bootutil_img_validate(loader_hdr, loader_fap, tmpbuf, BOOT_TMPBUF_SZ,
                              NULL, 0, loader_hash)) {
        return BOOT_EBADIMAGE;
    }

    if (bootutil_img_validate(app_hdr, app_fap, tmpbuf, BOOT_TMPBUF_SZ,
                              loader_hash, CY_BOOTLDR_SHA256_LEN, NULL)) {
        return BOOT_EBADIMAGE;
    }

    return 0;
}
#endif /* MCUBOOT_USE_FLASHBOOT_CRYPTO */

static int
boot_validate_slot(int slot)
{
    const struct flash_area *fap;
    struct cy_image_header *hdr;
    int rc;

    hdr = boot_img_hdr(&boot_data, slot);
    if (hdr->ih_magic == 0xffffffff || (hdr->ih_flags & IMAGE_F_NON_BOOTABLE)) {
        /* No bootable image in slot; continue booting from slot 0. */
        return CY_BOOTLDR_GENERIC_ERROR;
    }

    rc = flash_area_open(flash_area_id_from_image_slot(slot), &fap);
    if (rc != 0) {
        return BOOT_EFLASH;
    }

    if (hdr->id != bnu_policy.bnu_img_policy.id) {
        return CY_BOOTLDR_GENERIC_ERROR;
    }

#if defined(MCUBOOT_ROLLBACK_PROTECTION)
    if(cy_compare_rollback_counter(&boot_data.imgs[slot].hdr) != 0)
    {
        return CY_BOOTLDR_GENERIC_ERROR;
    }
#endif

#if defined(MCUBOOT_USE_FLASHBOOT_CRYPTO)
    if ((hdr->ih_magic != IMAGE_MAGIC || boot_image_check(hdr, fap, slot) != 0)) {
#else
    if ((hdr->ih_magic != IMAGE_MAGIC || boot_image_check(hdr, fap) != 0)) {
#endif
        if (slot != 0) {
            flash_area_erase(fap, 0, fap->fa_size);
            /* Image in slot 1 is invalid. Erase the image and
             * continue booting from slot 0.
             */
        }
        BOOT_LOG_ERR("Image in slot %d is not valid!", slot);
        return CY_BOOTLDR_GENERIC_ERROR;
    }

    flash_area_close(fap);

#if defined(MCUBOOT_ROLLBACK_PROTECTION)
    rc = cy_write_rollback_counter(&boot_data.imgs[slot].hdr);
    if(0 != rc)
    {
        return CY_BOOTLDR_GENERIC_ERROR;
    }
#endif

    /* Image in slot 1 is valid. */
    return 0;
}

/*
 * Image in staging area is double wrapped:
 *  - by MCUboot format
 *  - by AES encryption
 *  */
#define CY_PSA_RES_RETURN(x)  if(PSA_SUCCESS != x)	break;
#define CY_PSA_DATA_SIZE	(256)	/* is is expected encrypted image is padded to 256byte blocks*/

#if ((CY_PSA_DATA_SIZE<256) || ((CY_PSA_DATA_SIZE%256)!=0))
#error "Encrypt block size must be >=256 and even to 256.(256, 512, etc)."
#endif

static int
boot_validate_slot_1(void)
{
    int slot = 1;

	fb_psa_cipher_operation_t	cipher_op;

	fb_psa_hash_operation_t	hash_op;
	fb_psa_key_slot_t 		ecc_key_id;
	psa_status_t 			psa_res;

	fb_psa_key_policy_t aes_policy;

	/* dedicate piece of memory for cipher/hash data */
	uint8_t in_dec_data[CY_PSA_DATA_SIZE];
	uint8_t hash_data[CY_BOOTLDR_SHA256_LEN];

	uint8_t hdr_aes_data[CY_BOOTLDR_AES128_KEY_LEN+CY_BOOTLDR_AES128_IV_LEN];
	uint8_t img_aes_data_key[CY_BOOTLDR_AES128_KEY_LEN];

	uint8_t *img_data_ptr;
	uint32_t img_data_size;
	uint32_t data_offset;

	uint32_t img_enc_blk_count;
	uint32_t img_enc_blk_rem;

	uint32_t i;
	uint32_t out_len;

	struct image_tlv_info	tlv_info;
	struct image_tlv 		tlv;

	/* allocate local virtual slot boot_data */
	struct boot_loader_state boot_data_virt_s1;

	/* assume no key was imported */
	import_img_key_flag = 0;
	import_hdr_key_flag = 0;

    /* process external regular wrapper */
    psa_res = boot_validate_slot(slot);

    /* key ID to decrypt header data : 6*/
    fb_psa_key_slot_t hdr_key_id = CY_BOOTLDR_HDR_KEY_ID;
    
    /* key ID to decrypt image itself : 7*/
    fb_psa_key_slot_t img_key_id = CY_BOOTLDR_AES_IMG_KEY_ID;
    
    /* Device Private key is complementary in ECDH scheme */
    fb_psa_key_slot_t key_id_pair = CY_BOOTLDR_DEV_PRIV_DER_KEY_ID;

    /* OEM Public key is complementary in ECDH scheme */
    fb_psa_key_slot_t key_id_peer_pub = cy_bootutil_find_key(slot);

    if(0 == psa_res)
    {
    	do /* one-time loop to have quick exit via break; */
    	{
    		/* clone the data from original global variable for simplicity
    		 * later will rewrite important fields only */
    		memcpy(&(boot_data_virt_s1),
    				&(boot_data),
					sizeof(boot_data));

    		/* prepare to read crypto_header */
    		img_data_ptr = (uint8_t *)(FLASH_DEVICE_BASE + boot_data_virt_s1.imgs[1].area->fa_off);

    		/* point to actual crypto_header */
    		encrypted_image_header *enc_img_hdr = (encrypted_image_header *)img_data_ptr;
			/* *
			 * - read salt+label from crypto header
			 * - process ECDH+KDF to obtain crypto_header key
			 * */
    		psa_res = Cy_ECDH_ExtractDerivedKey(&enc_img_hdr->crypto_data,
                                                key_id_pair,
                                                key_id_peer_pub,
    		                                    hdr_aes_data);

    		CY_PSA_RES_RETURN(psa_res);

    	    fb_psa_key_policy_init( &aes_policy );
    	    fb_psa_key_policy_set_usage( &aes_policy,
    	    							PSA_KEY_USAGE_DECRYPT,
                                        (PSA_ALG_CBC_NO_PADDING));

    	    psa_res = fb_psa_set_key_policy( hdr_key_id, &aes_policy );
			CY_PSA_RES_RETURN(psa_res);

			/* import crypto_header key */
			psa_res = fb_psa_import_key( hdr_key_id,
										PSA_KEY_TYPE_AES,
										hdr_aes_data,
										CY_BOOTLDR_AES128_KEY_LEN);
			import_hdr_key_flag = 1;
			CY_PSA_RES_RETURN(psa_res);

            psa_res = fb_psa_cipher_decrypt_setup(&cipher_op, hdr_key_id, (PSA_ALG_CBC_NO_PADDING));
			CY_PSA_RES_RETURN(psa_res);

			psa_res = fb_psa_cipher_set_iv(&cipher_op,		/* operation, */
										hdr_aes_data+CY_BOOTLDR_AES128_KEY_LEN,/* iv, */
										CY_BOOTLDR_AES128_IV_LEN				/* iv_length */ );
			CY_PSA_RES_RETURN(psa_res);

			/* read and decrypt image AES KEY+IV */
			psa_res = fb_psa_cipher_update(&cipher_op,					/* operation, */
										(const uint8_t *)enc_img_hdr->crypto_data.encrypted_secret,		/* input, */
										2*CY_IMG_CRYPTO_BLK_SIZE,	/* input_length, */
										in_dec_data,				/* output, */
										2*CY_IMG_CRYPTO_BLK_SIZE,	/* output_size, */
										(size_t *)&out_len			/* output_length */ );
			if(2*CY_IMG_CRYPTO_BLK_SIZE != out_len)
			{
				psa_res = CY_BOOTLDR_GENERIC_ERROR;
			}
			CY_PSA_RES_RETURN(psa_res);

