dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_AUGUST_CYW43012_M0_PSA/mcuboot/bootutil/src/loader.c
			/* close decrypt operation  */
			psa_res = fb_psa_cipher_finish(&cipher_op,			/* operation, */
										in_dec_data,		/* output, */
										0,					/* output_size, */
										(size_t *)&out_len	/* output_length*/ );
			CY_PSA_RES_RETURN(psa_res);

			/* pull AES crypto data out of in_dec_data since it will be overwritten */
			/* copy AES image key */
			memcpy(img_aes_data_key, in_dec_data, CY_BOOTLDR_AES128_KEY_LEN);
			/* copy AES image IV */
			memcpy(cy_bldr_img_aes_iv, in_dec_data+CY_BOOTLDR_AES128_KEY_LEN, CY_BOOTLDR_AES128_IV_LEN);
    	    psa_res = fb_psa_set_key_policy( img_key_id, &aes_policy );
			CY_PSA_RES_RETURN(psa_res);

			/* import decrypted AES KEY+IV(ID=4) */
			psa_res = fb_psa_import_key( img_key_id,
										PSA_KEY_TYPE_AES,
										img_aes_data_key,
										CY_BOOTLDR_AES128_KEY_LEN);
			import_img_key_flag = 1;
			CY_PSA_RES_RETURN(psa_res);

			psa_res = fb_psa_hash_setup(&hash_op, PSA_ALG_SHA_256);
			CY_PSA_RES_RETURN(psa_res);

			/* data to start decrypt from is actually from image_start+header_size */
			/* fa_off points to AES-128 wrapper-image start, so offset to encrypted by hdr_size */
			img_data_ptr = (uint8_t *)(img_data_ptr + CY_IMG_HDR_SIZE);

			psa_res = fb_psa_cipher_decrypt_setup(&cipher_op, img_key_id, (PSA_ALG_CBC_NO_PADDING));

			CY_PSA_RES_RETURN(psa_res);

			psa_res = fb_psa_cipher_set_iv(&cipher_op,		/* operation, */
										cy_bldr_img_aes_iv,/* iv, */
										CY_BOOTLDR_AES128_IV_LEN    /* iv_length */ );
			CY_PSA_RES_RETURN(psa_res);

			psa_res = fb_psa_cipher_update(&cipher_op,			/* operation, */
										(const uint8_t *)img_data_ptr,		/* input, */
										CY_PSA_DATA_SIZE,	/* input_length, */
										in_dec_data,		/* output, */
										CY_PSA_DATA_SIZE,	/* output_size, */
										(size_t *)&out_len	/* output_length */ );

			if(CY_PSA_DATA_SIZE != out_len)
			{
				psa_res = CY_BOOTLDR_GENERIC_ERROR;
			}
			CY_PSA_RES_RETURN(psa_res);

			/* header piece is ready at this point, copy it to virtual slot boot_data */
			/* header now contains data about internal encrypted image */
			memcpy(&(boot_data_virt_s1.imgs[1].hdr), in_dec_data, sizeof(struct image_header));

	    	/* check decrypted header data */
			if ((boot_data_virt_s1.imgs[1].hdr.ih_magic == 0xffffffff) ||
				(boot_data_virt_s1.imgs[1].hdr.ih_flags & IMAGE_F_NON_BOOTABLE) ||
				(boot_data_virt_s1.imgs[1].hdr.ih_img_size > boot_data.imgs[1].area->fa_size) ||
				(boot_data_virt_s1.imgs[1].hdr.ih_magic != IMAGE_MAGIC)){
				/* No bootable image in slot; continue booting from slot 0. */
				psa_res = CY_BOOTLDR_GENERIC_ERROR;
			}
            CY_PSA_RES_RETURN(psa_res);

			psa_res = fb_psa_hash_update(&hash_op,
										in_dec_data,
										out_len);
			CY_PSA_RES_RETURN(psa_res);

			/* calculate encrypted data size, includes:
			 * - header
			 * - image itself
			 * */
			img_data_size = boot_data_virt_s1.imgs[1].hdr.ih_img_size + CY_IMG_HDR_SIZE;

			img_enc_blk_count = img_data_size/CY_PSA_DATA_SIZE;
			img_enc_blk_rem = img_data_size%CY_PSA_DATA_SIZE;

			if(0 != img_enc_blk_rem)
			{
				img_enc_blk_count++;
			}
			/* offset forward since we've already processed first 1 block */
			img_data_ptr += CY_PSA_DATA_SIZE;

			/* go through whole encrypted sub-image */
			for(i=1; ((i<img_enc_blk_count)&&(PSA_SUCCESS == psa_res)); i++)
			{
				psa_res = fb_psa_cipher_update(&cipher_op,						/* operation, */
											(const uint8_t *)img_data_ptr,	/* input, */
											CY_PSA_DATA_SIZE,				/* input_length, */
											in_dec_data,					/* output, */
											CY_PSA_DATA_SIZE,				/* output_size, */
											(size_t *)&out_len				/* output_length */
											);
				if(CY_PSA_DATA_SIZE != out_len)
				{
					psa_res = CY_BOOTLDR_GENERIC_ERROR;
				}

				if(PSA_SUCCESS == psa_res)
				{
					psa_res = fb_psa_hash_update(&hash_op,
												in_dec_data,
												out_len);
				}
				/* increment img_data_ptr */
				img_data_ptr += CY_PSA_DATA_SIZE;
			}
			CY_PSA_RES_RETURN(psa_res);

			psa_res = fb_psa_hash_finish(&hash_op,
	    	                             hash_data,
	    	                             CY_BOOTLDR_SHA256_LEN,
										 (size_t *)&out_len);
			CY_PSA_RES_RETURN(psa_res);
			/* hash_data contains image hash now */

			/* extract image trailer metadata - magic, tlvs, hashes, signature */
			psa_res = fb_psa_cipher_update(&cipher_op,						/* operation, */
										(const uint8_t *)img_data_ptr,	/* input, */
										CY_PSA_DATA_SIZE,				/* input_length, */
										in_dec_data,					/* output, */
										CY_PSA_DATA_SIZE,				/* output_size, */
										(size_t *)&out_len				/* output_length */
										);
			CY_PSA_RES_RETURN(psa_res);

			/* close decrypt operation  */
			psa_res = fb_psa_cipher_finish(&cipher_op,			/* operation, */
										in_dec_data,		/* output, */
										0,	/* output_size, */
										(size_t *)&out_len	/* output_length*/
										);

			/* in_dec_data contains whole image trailer metadata */
			/* copy tlv_info first */
			memcpy(&tlv_info, in_dec_data, sizeof(tlv_info));

			/* check TLV data here */
		    if (tlv_info.it_magic != IMAGE_TLV_INFO_MAGIC)
		    {
		        psa_res = CY_BOOTLDR_GENERIC_ERROR;
		    }
			CY_PSA_RES_RETURN(psa_res);

			/* look for first TLV */
			data_offset = sizeof(struct image_tlv_info);
			/* copy data before processing */
			memcpy(&tlv, in_dec_data+data_offset, sizeof(tlv));

			if (tlv.it_type != IMAGE_TLV_SHA256)
		    {
		        psa_res = CY_BOOTLDR_GENERIC_ERROR;
		    }
			CY_PSA_RES_RETURN(psa_res);
			/*
			* Verify the SHA256 image hash.  This must always be
			* present.
			*/
			if (tlv.it_len != CY_BOOTLDR_SHA256_LEN)
			{
				psa_res =  CY_BOOTLDR_GENERIC_ERROR;
			}
			CY_PSA_RES_RETURN(psa_res);

			/* look for image_hash_data inside decrypted packet */
			data_offset = data_offset + sizeof(struct image_tlv);

			/* check for integrity - calculated hash VS encrypted hash */
			psa_res = memcmp(hash_data, in_dec_data + data_offset, CY_BOOTLDR_SHA256_LEN);
			CY_PSA_RES_RETURN(psa_res);

			/* look for key_hash TLV inside decrypted packet */
			data_offset = data_offset + CY_BOOTLDR_SHA256_LEN;
			/* copy data before processing */
			memcpy(&tlv, in_dec_data+data_offset, sizeof(tlv));

