dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_AUGUST_CYW43012_M0_PSA/mcuboot/bootutil/src/loader.c
			if (tlv.it_type != IMAGE_TLV_KEYHASH)
		    {
		        psa_res = CY_BOOTLDR_GENERIC_ERROR;
		    }
			CY_PSA_RES_RETURN(psa_res);

			/* look for key_hash_data inside decrypted packet */
			data_offset = data_offset + sizeof(struct image_tlv);
			/* look for validation key ID */
            
            ecc_key_id = cy_bootutil_find_key(slot);

			/* look for signature TLV inside decrypted packet */
			data_offset = data_offset + CY_BOOTLDR_SHA256_LEN;
			/* copy data before processing */
			memcpy(&tlv, in_dec_data+data_offset, sizeof(tlv));

			/* look for EC256 signature type */
			if (tlv.it_type != IMAGE_TLV_ECDSA256)
			{
				psa_res = CY_BOOTLDR_GENERIC_ERROR;
			}
			CY_PSA_RES_RETURN(psa_res);

			/* look for valid signature length */
			if (tlv.it_len != CY_BOOTLDR_ECSIG_DER_LEN)
			{
				psa_res =  CY_BOOTLDR_GENERIC_ERROR;
			}
			CY_PSA_RES_RETURN(psa_res);

			/* look for signature_data inside decrypted packet */
			data_offset = data_offset + sizeof(struct image_tlv);

			psa_res = cy_bootutil_verify_sig(hash_data,     /* hash, */
                                                CY_BOOTLDR_SHA256_LEN,          /* hlen, */
                                                (uint8_t *)in_dec_data+data_offset, /* sig, */
                                                CY_BOOTLDR_ECSIG_DER_LEN,           /* slen, */
                                                ecc_key_id          /* key_id */ );
    	}
    	while(0);
    }
    
    /* destroy header encryption key if imported */
    int psa_res_tmp;
	if(import_hdr_key_flag != 0)
	{
        psa_res_tmp = fb_psa_destroy_key(hdr_key_id);
        if (PSA_SUCCESS != psa_res_tmp)
        {
            psa_res = psa_res_tmp;
        }
	}
    /* clean sensitive data */
    memset(hdr_aes_data, 0x00, sizeof(hdr_aes_data));
    memset(img_aes_data_key, 0x00, sizeof(img_aes_data_key));
    memset(in_dec_data, 0x00, sizeof(in_dec_data));
    memset(hash_data, 0x00, sizeof(hash_data));

    return psa_res;
}
/**
 * Determines which swap operation to perform, if any.  If it is determined
 * that a swap operation is required, the image in the second slot is checked
 * for validity.  If the image in the second slot is invalid, it is erased, and
 * a swap type of "none" is indicated.
 *
 * @return                      The type of swap to perform (BOOT_SWAP_TYPE...)
 */
static int
boot_validated_swap_type(void)
{
    int swap_type, rc;

    swap_type = boot_swap_type();
    switch (swap_type) {
    case BOOT_SWAP_TYPE_TEST:
    case BOOT_SWAP_TYPE_PERM:
    case BOOT_SWAP_TYPE_REVERT:
    	/* Boot loader wants to switch to slot 1. Ensure image is valid. */
    	if(true == bnu_policy.bnu_img_policy.encrypt)
    	{	/* validate slot_1 encrypted */
    	    BOOT_LOG_INF("Encrypted");
    		rc = boot_validate_slot_1();
    	}
    	else
    	{	/* validate slot 1 as generic */
    	    BOOT_LOG_INF("NON-Encrypted");
    		rc = boot_validate_slot(1);
    	}
    	if(0 != rc)
    	{
    		swap_type = BOOT_SWAP_TYPE_FAIL;
    	}
    	break;
    }

    return swap_type;
}

/**
 * Calculates the number of sectors the scratch area can contain.  A "last"
 * source sector is specified because images are copied backwards in flash
 * (final index to index number 0).
 *
 * @param last_sector_idx       The index of the last source sector
 *                                  (inclusive).
 * @param out_first_sector_idx  The index of the first source sector
 *                                  (inclusive) gets written here.
 *
 * @return                      The number of bytes comprised by the
 *                                  [first-sector, last-sector] range.
 */
#ifndef MCUBOOT_OVERWRITE_ONLY
static uint32_t
boot_copy_sz(int last_sector_idx, int *out_first_sector_idx)
{
    size_t scratch_sz;
    uint32_t new_sz;
    uint32_t sz;
    int i;

    sz = 0;

    scratch_sz = boot_scratch_area_size(&boot_data);
    for (i = last_sector_idx; i >= 0; i--) {
        new_sz = sz + boot_img_sector_size(&boot_data, 0, i);
        if (new_sz > scratch_sz) {
            break;
        }
        sz = new_sz;
    }

    /* i currently refers to a sector that doesn't fit or it is -1 because all
     * sectors have been processed.  In both cases, exclude sector i.
     */
    *out_first_sector_idx = i + 1;
    return sz;
}
#endif /* !MCUBOOT_OVERWRITE_ONLY */

/**
 * Erases a region of flash.
 *
 * @param flash_area_idx        The ID of the flash area containing the region
 *                                  to erase.
 * @param off                   The offset within the flash area to start the
 *                                  erase.
 * @param sz                    The number of bytes to erase.
 *
 * @return                      0 on success; nonzero on failure.
 */
static int
boot_erase_sector(int flash_area_id, uint32_t off, uint32_t sz)
{
    const struct flash_area *fap;
    int rc;

    rc = flash_area_open(flash_area_id, &fap);
    if (rc != 0) {
        rc = BOOT_EFLASH;
        goto done;
    }

    rc = flash_area_erase(fap, off, sz);
    if (rc != 0) {
        rc = BOOT_EFLASH;
        goto done;
    }

    rc = 0;

done:
    flash_area_close(fap);
    return rc;
}

/**
 * Copies the contents of one flash region to another.  You must erase the
 * destination region prior to calling this function.
 *
 * @param flash_area_id_src     The ID of the source flash area.
 * @param flash_area_id_dst     The ID of the destination flash area.
 * @param off_src               The offset within the source flash area to
 *                                  copy from.
 * @param off_dst               The offset within the destination flash area to
 *                                  copy to.
 * @param sz                    The number of bytes to copy.
 *
 * @return                      0 on success; nonzero on failure.
 */
static int
boot_copy_sector(int flash_area_id_src, int flash_area_id_dst,
                 uint32_t off_src, uint32_t off_dst, uint32_t sz)
{
    const struct flash_area *fap_src;
    const struct flash_area *fap_dst;
    uint32_t bytes_copied;
    int chunk_sz;
    int rc;

    uint8_t buf[1024];

    fap_src = NULL;
    fap_dst = NULL;

    rc = flash_area_open(flash_area_id_src, &fap_src);
    if (rc != 0) {
        rc = BOOT_EFLASH;
        goto done;
    }

    rc = flash_area_open(flash_area_id_dst, &fap_dst);
    if (rc != 0) {
        rc = BOOT_EFLASH;
        goto done;
    }

    bytes_copied = 0;
    while (bytes_copied < sz) {
        if (sz - bytes_copied > sizeof buf) {
            chunk_sz = sizeof buf;
        } else {
            chunk_sz = sz - bytes_copied;
        }

        rc = flash_area_read(fap_src, off_src + bytes_copied, buf, chunk_sz);
        if (rc != 0) {
            rc = BOOT_EFLASH;
            goto done;
        }

        rc = flash_area_write(fap_dst, off_dst + bytes_copied, buf, chunk_sz);
        if (rc != 0) {
            rc = BOOT_EFLASH;
            goto done;
        }

        bytes_copied += chunk_sz;
    }

    rc = 0;

done:
    if (fap_src) {
        flash_area_close(fap_src);
    }
    if (fap_dst) {
        flash_area_close(fap_dst);
    }
    return rc;
}

/**
 * Copies the contents of one flash region to another.  You must erase the
 * destination region prior to calling this function.
 *
 * @param flash_area_id_src     The ID of the source flash area.
 * @param flash_area_id_dst     The ID of the destination flash area.
 * @param off_src               The offset within the source flash area to
 *                                  copy from.
 * @param off_dst               The offset within the destination flash area to
 *                                  copy to.
 * @param sz                    The number of bytes to copy.
 *
 * @return                      0 on success; nonzero on failure.
 */
static int
boot_copy_encrypted_sector(int flash_area_id_src, int flash_area_id_dst,
                 uint32_t off_src, uint32_t off_dst, uint32_t sz)
{
    const struct flash_area *fap_src;
    const struct flash_area *fap_dst;
    uint32_t bytes_copied;
    int chunk_sz;
    int rc;

    static uint8_t buf[1024];

   	fb_psa_cipher_operation_t	cipher_op_1;
   	fb_psa_key_slot_t 			aes_key_id;
   	psa_status_t 			psa_res;
    
	uint8_t const *img_data_ptr;
	uint32_t out_len;

    fap_src = NULL;
    fap_dst = NULL;

    rc = flash_area_open(flash_area_id_src, &fap_src);
    if (rc != 0) {
        rc = BOOT_EFLASH;
        goto done;
    }

    rc = flash_area_open(flash_area_id_dst, &fap_dst);
    if (rc != 0) {
        rc = BOOT_EFLASH;
        goto done;
    }

    global_ptr = &cipher_op_1;

    do
    {
	    aes_key_id = CY_BOOTLDR_AES_IMG_KEY_ID;

		psa_res = fb_psa_cipher_decrypt_setup(
											&cipher_op_1,
											aes_key_id,
											(PSA_ALG_CBC_NO_PADDING));
		CY_PSA_RES_RETURN(psa_res);

		psa_res = fb_psa_cipher_set_iv(&cipher_op_1,						/* operation, */
									(const uint8_t *)cy_bldr_img_aes_iv,/* iv, */
									CY_BOOTLDR_AES128_IV_LEN );
		CY_PSA_RES_RETURN(psa_res);

