dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/TARGET_AUGUST_CYW43012_M0_PSA/mcuboot/bootutil/src/loader.c
		/* substitute size with wrapper's input data size */
		sz = boot_data.imgs[1].hdr.ih_img_size;

		/* decrypt and copy encrypted header+image+trailer+signature */
		sz = sz + CY_BOOTLDR_ALIGNED_TRL_SIZE;

		bytes_copied = 0;

		/* offset data by wrapper's header block */
		img_data_ptr = (uint8_t const *)(FLASH_DEVICE_BASE+CY_IMG_HDR_SIZE);

		/* offset inside flash area */
		img_data_ptr = img_data_ptr +  fap_src->fa_off + off_src;

		while ((bytes_copied < sz)&&(PSA_SUCCESS == psa_res))
		{
			if (sz - bytes_copied > sizeof buf) {
				chunk_sz = sizeof buf;
			} else {
				chunk_sz = sz - bytes_copied;
			}

			/* decrypt from Flash into buffer directly */
			psa_res = fb_psa_cipher_update(
										&cipher_op_1,						/* *operation, */
										(const uint8_t *)(img_data_ptr + bytes_copied),	/* input[], */
										chunk_sz,						/* input_length, */
										buf,							/* output[], */
										chunk_sz,						/* output_size, */
										(size_t *)&out_len				/* *output_length */
										);
			if(chunk_sz != out_len)
			{
				psa_res = CY_BOOTLDR_GENERIC_ERROR;
			}

			if(PSA_SUCCESS == psa_res)
			{
				if (rc != 0) {
					rc = BOOT_EFLASH;
					goto done;
				}

				rc = flash_area_write(fap_dst, off_dst + bytes_copied, buf, chunk_sz);
				if (rc != 0) {
					rc = BOOT_EFLASH;
					goto done;
				}

				bytes_copied += chunk_sz;
			}
		}
        CY_PSA_RES_RETURN(psa_res);
		/* close decrypt operation  */
		psa_res = fb_psa_cipher_finish(
									&cipher_op_1,			/* operation, */
									buf,				/* output, */
									0,					/* output_size, */
									(size_t *)&out_len	/* output_length*/
									);
    }
    while(0);

    rc = psa_res;
done:
    if (fap_src) {
        flash_area_close(fap_src);
    }
    if (fap_dst) {
        flash_area_close(fap_dst);
    }

    /* destroy image encryption key if imported */
    int psa_res_tmp;
    if(import_img_key_flag != 0)
    {
        psa_res_tmp = fb_psa_destroy_key(aes_key_id);
        if (PSA_SUCCESS != psa_res_tmp)
        {
            psa_res = psa_res_tmp;
        }
    }
    /* clean sensitive data */
    memset(cy_bldr_img_aes_iv, 0x00, sizeof(cy_bldr_img_aes_iv));    
    
    return rc;
}

#ifndef MCUBOOT_OVERWRITE_ONLY
static inline int
boot_status_init_by_id(int flash_area_id, const struct boot_status *bs)
{
    const struct flash_area *fap;
    struct boot_swap_state swap_state;
    int rc;

    rc = flash_area_open(flash_area_id, &fap);
    assert(rc == 0);

    rc = boot_read_swap_state_by_id(FLASH_AREA_IMAGE_1, &swap_state);
    assert(rc == 0);

    if (swap_state.image_ok == BOOT_FLAG_SET) {
        rc = boot_write_image_ok(fap);
        assert(rc == 0);
    }

    rc = boot_write_swap_size(fap, bs->swap_size);
    assert(rc == 0);

    rc = boot_write_magic(fap);
    assert(rc == 0);

    flash_area_close(fap);

    return 0;
}
#endif

#ifndef MCUBOOT_OVERWRITE_ONLY
static int
boot_erase_last_sector_by_id(int flash_area_id)
{
    uint8_t slot;
    uint32_t last_sector;
    int rc;

    switch (flash_area_id) {
    case FLASH_AREA_IMAGE_0:
        slot = 0;
        break;
    case FLASH_AREA_IMAGE_1:
        slot = 1;
        break;
    default:
        return BOOT_EFLASH;
    }

    last_sector = boot_img_num_sectors(&boot_data, slot) - 1;
    rc = boot_erase_sector(flash_area_id,
            boot_img_sector_off(&boot_data, slot, last_sector),
            boot_img_sector_size(&boot_data, slot, last_sector));
    assert(rc == 0);

    return rc;
}
#endif /* !MCUBOOT_OVERWRITE_ONLY */

/**
 * Swaps the contents of two flash regions within the two image slots.
 *
 * @param idx                   The index of the first sector in the range of
 *                                  sectors being swapped.
 * @param sz                    The number of bytes to swap.
 * @param bs                    The current boot status.  This struct gets
 *                                  updated according to the outcome.
 *
 * @return                      0 on success; nonzero on failure.
 */
#ifndef MCUBOOT_OVERWRITE_ONLY
static void
boot_swap_sectors(int idx, uint32_t sz, struct boot_status *bs)
{
    const struct flash_area *fap;
    uint32_t copy_sz;
    uint32_t trailer_sz;
    uint32_t img_off;
    uint32_t scratch_trailer_off;
    struct boot_swap_state swap_state;
    size_t last_sector;
    int rc;

    /* Calculate offset from start of image area. */
    img_off = boot_img_sector_off(&boot_data, 0, idx);

    copy_sz = sz;
    trailer_sz = boot_slots_trailer_sz(BOOT_WRITE_SZ(&boot_data));

    /* sz in this function is always is always sized on a multiple of the
     * sector size. The check against the start offset of the last sector
     * is to determine if we're swapping the last sector. The last sector
     * needs special handling because it's where the trailer lives. If we're
     * copying it, we need to use scratch to write the trailer temporarily.
     *
     * NOTE: `use_scratch` is a temporary flag (never written to flash) which
     * controls if special handling is needed (swapping last sector).
     */
    last_sector = boot_img_num_sectors(&boot_data, 0) - 1;
    if (img_off + sz > boot_img_sector_off(&boot_data, 0, last_sector)) {
        copy_sz -= trailer_sz;
    }

    bs->use_scratch = (bs->idx == 0 && copy_sz != sz);

    if (bs->state == 0) {
        rc = boot_erase_sector(FLASH_AREA_IMAGE_SCRATCH, 0, sz);
        assert(rc == 0);

        rc = boot_copy_sector(FLASH_AREA_IMAGE_1, FLASH_AREA_IMAGE_SCRATCH,
                              img_off, 0, copy_sz);
        assert(rc == 0);

        if (bs->idx == 0) {
            if (bs->use_scratch) {
                boot_status_init_by_id(FLASH_AREA_IMAGE_SCRATCH, bs);
            } else {
                /* Prepare the status area... here it is known that the
                 * last sector is not being used by the image data so it's
                 * safe to erase.
                 */
                rc = boot_erase_last_sector_by_id(FLASH_AREA_IMAGE_0);
                assert(rc == 0);

